package com.pb.sendetskij.hw1;
/*
1. Скачать и установить JDK на https://oracle.com/
2. Скачать и установить Git https://git-scm.com/download/
3. Пройти регистрацию на https://github.com
4. https://github.com создать токен Setting / Developer setting / Personal access token / Generate new token
5. Скачать и устновить IntelliJ IDEA https://www.jetbrains.com/ru-ru/idea/download
6. Создать проект в IntelliJ IDEA
7. В IntelliJ IDEA - File / Setting / Version Control / GIT / Указать путь к файлу git.exe нажать Test для проверки версии гита
8. В IntelliJ IDEA добавить токен п4. - Setting / Version Control / GITHub / + / Use token
9. В IntelliJ IDEA - VCS / для проекта добавить систему версий GIT
10. В IntelliJ IDEA  создать проект на Git - VCS / Import Into Version Control / Share Project on GitHub
11. Команды:
      VCS / GIT / Commit File - Коомит проэкта
      VCS / GIT / Push - Залить на гит
      VCS / GIT / Pull - Взять файл с гита
 */
public class HelloWorld {
    public static void main(String[] args) {
        System.out.println("HelloWorld");
        System.out.println("Вкажіть один математичний оператор для виконнаня дій: '+','-','*','\'");
    }
}
